---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength.TripleProductSign
source: html/328f466e-e8f3-f393-968e-75ca63c9d441.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeConstraintProjectedSegmentLength.TripleProductSign Property

Sign of the z-coordinate of the cross
 product of the Direction property with the segment vector.
 TripleProductSign is 1 if the segment direction is to be on the left of
 the constraint direction,
 or -1 if the segment direction is to be on the right.

## Syntax (C#)
```csharp
public int TripleProductSign { get; }
```